# Imports

In [46]:
import pandas as pd

# Create dataframe using Series

In [2]:
# create a list of students
nom_etudiant = ["Slim","Neder","Mohamed","Amen"]

In [3]:
# create a series from the list of values
nom_etudiant = pd.Series(nom_etudiant, name="nom_etudiant")
nom_etudiant

0       Slim
1      Neder
2    Mohamed
3       Amen
Name: nom_etudiant, dtype: object

In [31]:
nom_etudiant.index

RangeIndex(start=0, stop=4, step=1)

## create a series from dictionary

In [11]:
etudiant = {"nom": "Foulen", "prenom":"benFoulen"}
etudiant = pd.Series(etudiant, name = "Etudiant1")
etudiant

nom          Foulen
prenom    benFoulen
Name: Etudiant1, dtype: object

## create dataframes

In [12]:
ids = [123,124,125,126,127]

# Creating series for names of students
nom = pd.Series(["Mohamed","Slim", "Amen", "Samar", "Ahmed"], name='Nom', index=ids)

# Creating series for Marks
note = pd.Series([18, 17, 19, 15, 16], name='note', index=ids)

# moyenne
moyenne = pd.Series([15, 10, 11, 12, 17], name="moyenne", index=ids)

# Combining the 2 series nom and note togther as columns of one dataframe.
df_etudiants = pd.DataFrame({'Nom': nom, 'Note': note, 'moyenne': moyenne})

df_etudiants

         Nom  Note  moyenne
123  Mohamed    18       15
124     Slim    17       10
125     Amen    19       11
126    Samar    15       12
127    Ahmed    16       17

# Load data from csv

In [13]:
data = pd.read_csv("etudiants.csv")

# Explore data

In [52]:
data.head()

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022
1,2,Euell,Gabbatt,egabbatt1@netlog.com,M,5/2/1996,bien,Business,"â‚¬2003,15",7.0,NaN,8/20/2017,12/5/2023
2,3,Adan,Antonchik,aantonchik2@toplist.cz,M,9/8/2003,bien,Licence-IT,"â‚¬2039,02",4.0,NaN,2/16/2017,6/15/2021
3,4,Lela,Cavilla,lcavilla3@umn.edu,F,3/7/1991,bien,ING-IT,"â‚¬3676,58",8.0,NaN,12/18/2015,5/15/2021
4,5,Banky,Pipet,bpipet4@sourceforge.net,M,27/3/1991,trÃ©s bien,Licence-IT,"â‚¬3660,16",9.0,sport,9/3/2016,5/12/2022

In [55]:
data.tail()

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
995,996,Tabbie,Burdas,tburdasrn@yale.edu,M,24/11/1990,passable,Prepa,"â‚¬2558,90",4.0,NaN,10/18/2016,5/9/2022
996,997,Simone,Tomsett,stomsettro@gov.uk,F,16/12/2001,passable,Licence-IT,"â‚¬4956,89",4.0,Danser,9/2/2017,10/20/2021
997,998,Joseito,Gavagan,jgavaganrp@scientificamerican.com,M,8/12/1994,bien,Business,"â‚¬3438,87",7.0,bricolage,3/4/2016,7/31/2024
998,999,Lucius,Erswell,lerswellrq@themeforest.net,M,25/10/2004,faible,ING-IT,"â‚¬4184,08",1.0,sport,11/15/2017,7/27/2023
999,1000,Robers,Theobold,rtheoboldrr@yellowpages.com,M,28/12/2000,passable,Licence-IT,"â‚¬2445,25",9.0,NaN,3/7/2016,11/8/2020

In [22]:
data.shape

(1000, 13)

In [23]:
data.shape[0]

1000

In [24]:
data.shape[1]

13

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_etudiant      1000 non-null   int64
 1   prenom_etudiant  1000 non-null   object
 2   nom_etudiant     1000 non-null   object
 3   email            1000 non-null   object
 4   sex              978 non-null    object
 5   date_naissance   1000 non-null   object
 6   mention          1000 non-null   object
 7   specialite       1000 non-null   object
 8   frais_scolarite  973 non-null    object
 9   cours_rate       1000 non-null   float64
 10  loisirs          406 non-null    object
 11  date_debut       1000 non-null   object
 12  date_sortie      1000 non-null   object
dtypes: float64(1), int64(1), object(11)
memory usage: 101.7+ KB

In [26]:
data.describe()

       id_etudiant   cours_rate
count  1000.000000  1000.000000
mean    500.500000     5.087000
std     288.819436     3.206823
min       1.000000     0.000000
25%     250.750000     2.000000
50%     500.500000     5.000000
75%     750.250000     8.000000
max    1000.000000    10.000000

# Slicing

In [26]:
data.head()

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022
1,2,Euell,Gabbatt,egabbatt1@netlog.com,M,5/2/1996,bien,Business,"â‚¬2003,15",7.0,NaN,8/20/2017,12/5/2023
2,3,Adan,Antonchik,aantonchik2@toplist.cz,M,9/8/2003,bien,Licence-IT,"â‚¬2039,02",4.0,NaN,2/16/2017,6/15/2021
3,4,Lela,Cavilla,lcavilla3@umn.edu,F,3/7/1991,bien,ING-IT,"â‚¬3676,58",8.0,NaN,12/18/2015,5/15/2021
4,5,Banky,Pipet,bpipet4@sourceforge.net,M,27/3/1991,trÃ©s bien,Licence-IT,"â‚¬3660,16",9.0,sport,9/3/2016,5/12/2022

## slice by rows

In [56]:
data["id_etudiant"] == 2

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: id_etudiant, Length: 1000, dtype: bool

In [57]:
data.loc[data["id_etudiant"] == 2 , :]

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
1,2,Euell,Gabbatt,egabbatt1@netlog.com,M,5/2/1996,bien,Business,"â‚¬2003,15",7.0,NaN,8/20/2017,12/5/2023

## Slice by columns

In [58]:
data.loc[:, ["id_etudiant","prenom_etudiant"]]

     id_etudiant prenom_etudiant
0              1             Tam
1              2           Euell
2              3            Adan
3              4            Lela
4              5           Banky
..           ...             ...
995          996          Tabbie
996          997          Simone
997          998         Joseito
998          999          Lucius
999         1000          Robers

[1000 rows x 2 columns]

## slice by rows and columns

In [59]:
data.columns

Index(['id_etudiant', 'prenom_etudiant', 'nom_etudiant', 'email', 'sex',
       'date_naissance', 'mention', 'specialite', 'frais_scolarite',
       'cours_rate', 'loisirs', 'date_debut', 'date_sortie'],
      dtype='object')

In [60]:
selected_columns = data.columns[0:4]
selected_columns

Index(['id_etudiant', 'prenom_etudiant', 'nom_etudiant', 'email'], dtype='object')

In [34]:
data.loc[(data["id_etudiant"]==2), selected_columns]

   id_etudiant prenom_etudiant nom_etudiant                 email
1            2           Euell      Gabbatt  egabbatt1@netlog.com

## Slice by iloc

In [35]:
data.head(1)

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022

In [61]:
data.iloc[[900,1,2],[1,2]]

    prenom_etudiant nom_etudiant
900          Dulcia       Gumery
1             Euell      Gabbatt
2              Adan    Antonchik

In [37]:
data.head(1)

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022

In [38]:
data.iloc[0:3,1:3]

  prenom_etudiant nom_etudiant
0             Tam     Sandwick
1           Euell      Gabbatt
2            Adan    Antonchik

In [41]:
data.head(1)

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022

## Select les etudiants qui ont un sex M

In [ ]:
data[data.sex == "M"]

In [ ]:
data[data["sex"]=="M"]

In [43]:
data.head(1)

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022

## Select les etudiants qui ont un sex M et qui ont eu mention bien

In [62]:
data.loc[(data["sex"]=="M") & (data["mention"]=="bien"),:]

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
1,2,Euell,Gabbatt,egabbatt1@netlog.com,M,5/2/1996,bien,Business,"â‚¬2003,15",7.0,NaN,8/20/2017,12/5/2023
2,3,Adan,Antonchik,aantonchik2@toplist.cz,M,9/8/2003,bien,Licence-IT,"â‚¬2039,02",4.0,NaN,2/16/2017,6/15/2021
7,8,Desmond,Heavyside,dheavyside7@china.com.cn,M,24/9/1996,bien,ING-IT,"â‚¬3417,44",0.0,NaN,1/24/2018,4/10/2020
10,11,Bentlee,McNickle,bmcnicklea@wp.com,M,16/5/1990,bien,Business,"â‚¬3000,31",7.0,NaN,10/14/2017,4/20/2024
12,13,Archy,Goulborn,agoulbornc@a8.net,M,19/12/1998,bien,Licence-IT,"â‚¬2589,71",0.0,NaN,10/31/2016,12/24/2023
...,...,...,...,...,...,...,...,...,...,...,...,...,...
978,979,Jared,Inold,jinoldr6@com.com,M,23/5/1997,bien,Prepa,"â‚¬3975,65",5.0,NaN,7/1/2016,6/24/2024
981,982,Emanuele,Phillips,ephillipsr9@mozilla.org,M,7/9/1992,bien,Prepa,"â‚¬2806,39",8.0,NaN,4/8/2018,4/11/2024
989,990,Salomo,Doorey,sdooreyrh@eventbrite.com,M,22/2/1995,bien,Licence-IT,"â‚¬3890,53",5.0,NaN,11/6/2017,7/5/2021
994,995,Binky,Luna,blunarm@ehow.com,M,10/1/2002,bien,Licence-IT,"â‚¬2819,91",2.0,NaN,5/18/2017,7/16/2023
997,998,Joseito,Gavagan,jgavaganrp@scientificamerican.com,M,8/12/1994,bien,Business,"â‚¬3438,87",7.0,bricolage,3/4/2016,7/31/2024

In [44]:
data[(data.sex == "M") & (data.mention == "bien")]

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
1,2,Euell,Gabbatt,egabbatt1@netlog.com,M,5/2/1996,bien,Business,"â‚¬2003,15",7.0,NaN,8/20/2017,12/5/2023
2,3,Adan,Antonchik,aantonchik2@toplist.cz,M,9/8/2003,bien,Licence-IT,"â‚¬2039,02",4.0,NaN,2/16/2017,6/15/2021
7,8,Desmond,Heavyside,dheavyside7@china.com.cn,M,24/9/1996,bien,ING-IT,"â‚¬3417,44",0.0,NaN,1/24/2018,4/10/2020
10,11,Bentlee,McNickle,bmcnicklea@wp.com,M,16/5/1990,bien,Business,"â‚¬3000,31",7.0,NaN,10/14/2017,4/20/2024
12,13,Archy,Goulborn,agoulbornc@a8.net,M,19/12/1998,bien,Licence-IT,"â‚¬2589,71",0.0,NaN,10/31/2016,12/24/2023
...,...,...,...,...,...,...,...,...,...,...,...,...,...
978,979,Jared,Inold,jinoldr6@com.com,M,23/5/1997,bien,Prepa,"â‚¬3975,65",5.0,NaN,7/1/2016,6/24/2024
981,982,Emanuele,Phillips,ephillipsr9@mozilla.org,M,7/9/1992,bien,Prepa,"â‚¬2806,39",8.0,NaN,4/8/2018,4/11/2024
989,990,Salomo,Doorey,sdooreyrh@eventbrite.com,M,22/2/1995,bien,Licence-IT,"â‚¬3890,53",5.0,NaN,11/6/2017,7/5/2021
994,995,Binky,Luna,blunarm@ehow.com,M,10/1/2002,bien,Licence-IT,"â‚¬2819,91",2.0,NaN,5/18/2017,7/16/2023
997,998,Joseito,Gavagan,jgavaganrp@scientificamerican.com,M,8/12/1994,bien,Business,"â‚¬3438,87",7.0,bricolage,3/4/2016,7/31/2024

In [45]:
data.head(1)

,id_etudiant,prenom_etudiant,nom_etudiant,email,sex,date_naissance,mention,specialite,frais_scolarite,cours_rate,loisirs,date_debut,date_sortie
0,1,Tam,Sandwick,tsandwick0@princeton.edu,M,17/7/1993,passable,Licence-IT,"â‚¬2773,84",2.0,sport,8/2/2018,8/22/2022

## Select les etudiants qui ont une specialitÃ© Business ou Licence-IT

In [ ]:
data[(data.specialite == "Business") | (data.specialite == "Licence-IT")]

## Select les etudiants qui ont un sex F et qui ont une specialitÃ© Business ou Licence-IT

In [ ]:
data[
    (data.sex == "F")&
     ((data.specialite == "Business") | (data.specialite == "Licence-IT"))
]